package com.test.demo.string;

import org.junit.Test;

/**
 * Created by 01210368 on 2017/5/12.
 */
public class StringDemo {
    /**
     * string的substring包头不包尾
     */
    @Test
    public void test01() {
        String s = "{\"departmentIds\":\"1,2\",\"jobNo\":\"23456789\",\"notes\":\"长度过长是怎么达到的？长度过长是怎么达到的？长度过长是怎么达到的？长度过长是怎么达到的？长度过长是怎么达到的？长度过长是怎么达到的？长度过长是怎么达到的？长度过长是怎么达到的？长度过长是怎么达到的？长度过长是怎么达到的？长度过长是怎么达到的？长度过长是怎么达到的？长度过长是怎么达到的？长度过长是怎么达到的？长度过长是怎么达到的？长度过长是怎么达到的？长度过长是怎么达到的？长度过长是怎么达到的？长度过长是怎么达到的？长度过长是怎么达到的？长度过长是怎么达到的？长度过长是怎么达到的？长度过长是怎么达到的？长度过长是怎么达到的？长度过长是怎么达到的？长度过长是怎么达到的？长度过长是怎么达到的？长度过长是怎么达到的？长度过长是怎么达到的？长度过长是怎么达到的？长度过长是怎么达到的？长度过长是怎么达到的？长度过长是怎么达到的？长度过长是怎么达到的？长度过长是怎么达到的？长度过长是怎么达到的？长度过长是怎么达到的？长度过长是怎么达到的？长度过长是怎么达到的？长度过长是怎么达到的？长度过长是怎么达到";
        System.out.println(s.length());
        s = s.substring(0,1);
        System.out.println(s);
    }
}
